In [1]:
import sqlite3
db=sqlite3.connect("E:\\DATA_TRAINED\\myfiles\\sports.db")
cur=db.cursor()

In [2]:
cur.execute("create table sport(id int primary key,sportname text unique,dateofevent date,country text not null)")

In [3]:
cur.execute("insert into sport values(1,'Cricket','2021-11-09','India')")

In [4]:
cur.execute("insert into sport values(2,'Tennis','2021-12-08','Srilanka')")

In [5]:
print(cur.rowcount,"  records inserted")

1   records inserted

In [6]:
res=cur.execute('select * from sport')
res.fetchall()

[(1, 'Cricket', '2021-11-09', 'India'),
 (2, 'Tennis', '2021-12-08', 'Srilanka')]

In [7]:
print(res)

<sqlite3.Cursor object at 0x00000150FD607E30>

In [8]:
res=cur.execute('insert into sport values(2,'Tennis','2021-12-08','Srilanka')")

SyntaxError: invalid syntax (Temp/ipykernel_17956/2973463866.py, line 1)

In [19]:
cur.execute("insert into sport values(4,'Foot','2021-12-19',Null)")

IntegrityError: NOT NULL constraint failed: sport.country

In [18]:
cur.execute("insert into sport values(3,'Football','2021-12-09','America')")

In [22]:
res=cur.execute('select * from sport')
db.commit()
res.fetchall()

[(1, 'Cricket', '2021-11-09', 'India'),
 (2, 'Tennis', '2021-12-08', 'Srilanka'),
 (3, 'Football', '2021-12-09', 'America')]

In [24]:
import sqlite3
con=sqlite3.connect("E:\\DATA_TRAINED\\myfiles\\empdatabase.db")

In [25]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id int primary key,name text,salary real,department text,position text,hiredate date)")
    con.commit()

In [31]:
con.execute("drop table employee")
sql_table(con)

In [33]:
cur=con.cursor()

In [35]:
cur.execute("insert into employee values(1,'Amit',20000,'Accounts','Manager','2022-06-23')")

In [38]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute("insert into employee values(?,?,?,?,?,?)",entities)
    con.commit()

In [43]:
entities=(3,'ravi',30000,'Admin','Asst Manager','2022-05-21')

In [44]:
sql_insert(con,entities)

In [45]:
cur.execute("select * from employee")
cur.fetchall()

[(1, 'Amit', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21')]

In [46]:
res=cur.execute("select * from employee")
res.fetchall()

[(1, 'Amit', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21')]

In [47]:
def sql_update(con):
    cur=con.cursor()
    cur.execute("update employee set Name='Martin' where id=1")
    con.commit()

In [48]:
sql_update(con)

In [49]:
res=cur.execute("select * from employee")
res.fetchall()

[(1, 'Martin', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21')]

In [4]:
cur.execute("insert into employee values(4,'Rohit',40000,'IT','Manager','2022-06-23')")

In [5]:
cur.execute("insert into employee values(5,'Ravi',8000,'IT','Clerk','2022-06-23')")

In [52]:
res=cur.execute("select * from employee")
res.fetchall()

[(1, 'Martin', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (4, 'Rohit', 40000.0, 'IT', 'Manager', '2022-06-23'),
 (5, 'Ravi', 8000.0, 'IT', 'Clerk', '2022-06-23')]

In [61]:
def sql_query(query):
    cur=con.cursor()
    res=cur.execute(query)
    return res

In [62]:
res=sql_query("select * from employee")

In [63]:
res.fetchall()

[(1, 'Martin', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (4, 'Rohit', 40000.0, 'IT', 'Manager', '2022-06-23'),
 (5, 'Ravi', 8000.0, 'IT', 'Clerk', '2022-06-23')]

In [64]:
q="select * from employee where id<4"
res=sql_query(q)
res.fetchall()

[(1, 'Martin', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21')]

In [65]:
q="select distinct department from employee "
res=sql_query(q)
res.fetchall()

[('Accounts',), ('Admin',), ('IT',)]

In [68]:
q="select count(distinct department) from employee "
res=sql_query(q)
res.fetchall()

[(3,)]

In [67]:
q="select count(distinct (department)) from employee "
res=sql_query(q)
res.fetchall()

[(3,)]

In [69]:
q="select sum(salary),position from employee group by position "
res=sql_query(q)
res.fetchall()

[(60000.0, 'Asst Manager'), (8000.0, 'Clerk'), (60000.0, 'Manager')]

In [70]:
q="select sum(salary),position from employee  "
res=sql_query(q)
res.fetchall()

[(128000.0, 'Manager')]

In [1]:
import sqlite3 as s
db=s.connect("E:\\DATA_TRAINED\\myfiles\\empdatabase.db")
cur=db.cursor()

In [2]:
entities=[(6,'Kalu',3000,'Accounts','Clerk','2022-05-21'),(7,'Bholu',13000,'Accounts','DM','2022-05-21')]
cur.executemany("insert into employee values(?,?,?,?,?,?)",entities)
db.commit()

In [7]:
res=cur.execute('select * from employee order by id')
res.fetchall()

[(1, 'Martin', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (4, 'Rohit', 40000.0, 'IT', 'Manager', '2022-06-23'),
 (5, 'Ravi', 8000.0, 'IT', 'Clerk', '2022-06-23'),
 (6, 'Kalu', 3000.0, 'Accounts', 'Clerk', '2022-05-21'),
 (7, 'Bholu', 13000.0, 'Accounts', 'DM', '2022-05-21')]

In [8]:
entities=[(8,'Kalu',3000,'Accounts','Clerk','2022-05-21'),(9,'Bholu',13000,'Accounts','DM','2022-05-21')]
cur.executemany("insert into employee values(?,?,?,?,?,?)",entities)
db.commit()

In [9]:
res=cur.execute('select * from employee order by id')
res.fetchall()

[(1, 'Martin', 20000.0, 'Accounts', 'Manager', '2022-06-23'),
 (2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21'),
 (4, 'Rohit', 40000.0, 'IT', 'Manager', '2022-06-23'),
 (5, 'Ravi', 8000.0, 'IT', 'Clerk', '2022-06-23'),
 (6, 'Kalu', 3000.0, 'Accounts', 'Clerk', '2022-05-21'),
 (7, 'Bholu', 13000.0, 'Accounts', 'DM', '2022-05-21'),
 (8, 'Kalu', 3000.0, 'Accounts', 'Clerk', '2022-05-21'),
 (9, 'Bholu', 13000.0, 'Accounts', 'DM', '2022-05-21')]

In [11]:
res=cur.execute('select * from employee order by id')
for row in res:
    print(row)

(1, 'Martin', 20000.0, 'Accounts', 'Manager', '2022-06-23')
(2, 'Mohan', 30000.0, 'Admin', 'Asst Manager', '2022-05-21')
(3, 'ravi', 30000.0, 'Admin', 'Asst Manager', '2022-05-21')
(4, 'Rohit', 40000.0, 'IT', 'Manager', '2022-06-23')
(5, 'Ravi', 8000.0, 'IT', 'Clerk', '2022-06-23')
(6, 'Kalu', 3000.0, 'Accounts', 'Clerk', '2022-05-21')
(7, 'Bholu', 13000.0, 'Accounts', 'DM', '2022-05-21')
(8, 'Kalu', 3000.0, 'Accounts', 'Clerk', '2022-05-21')
(9, 'Bholu', 13000.0, 'Accounts', 'DM', '2022-05-21')

In [12]:
import sqlite3 as s
db=s.connect("E:\\DATA_TRAINED\\myfiles\\studentdatabase.db")
cur=db.cursor()

In [25]:
cur.execute("drop table course")
cur.execute("create table course(course_id int primary key,coursename text,duration int)")

In [26]:
cur.execute("drop table student")
cur.execute("create table student(student_id int primary key,studentname text,age int,course_id int,foreign key(course_id) references course(course_id))")

In [27]:
cur.execute("insert into course values(1,'DS',2),(2,'DCO',3),(3,'Funda',1),(4,'SE',1)")

In [28]:
res=cur.execute("select * from course")
for row in res:
    print(row)

(1, 'DS', 2)
(2, 'DCO', 3)
(3, 'Funda', 1)
(4, 'SE', 1)

In [29]:
cur.execute("insert into student values(101,'Amit',25,4),(102,'Sumit',28,2),(103,'Kapil',30,2),(104,'Raju',31,1)")

In [30]:
res=cur.execute("select * from student")
for row in res:
    print(row)

(101, 'Amit', 25, 4)
(102, 'Sumit', 28, 2)
(103, 'Kapil', 30, 2)
(104, 'Raju', 31, 1)

In [31]:
cur.execute("insert into student values(101,'Amit',25,4)")

IntegrityError: UNIQUE constraint failed: student.student_id

In [32]:
cur.execute("insert into student values(105,'Amit',25,5)")

In [33]:
res=cur.execute("select * from student")
for row in res:
    print(row)

(101, 'Amit', 25, 4)
(102, 'Sumit', 28, 2)
(103, 'Kapil', 30, 2)
(104, 'Raju', 31, 1)
(105, 'Amit', 25, 5)

In [34]:
res=cur.execute("select * from course")
for row in res:
    print(row)

(1, 'DS', 2)
(2, 'DCO', 3)
(3, 'Funda', 1)
(4, 'SE', 1)

# Subquery / Nested Query

In [39]:
res=cur.execute("select * from student where course_id=(select course_id from course where coursename='DCO')")

In [40]:
for row in res:
    print(row)

(102, 'Sumit', 28, 2)
(103, 'Kapil', 30, 2)

# Joins

In [42]:
res=cur.execute("select * from student INNER JOIN course on student.course_id=course.course_id")
for row in res:
    print(row)

(101, 'Amit', 25, 4, 4, 'SE', 1)
(102, 'Sumit', 28, 2, 2, 'DCO', 3)
(103, 'Kapil', 30, 2, 2, 'DCO', 3)
(104, 'Raju', 31, 1, 1, 'DS', 2)

In [44]:
res=cur.execute("select * from student FULL OUTER JOIN course on student.course_id=course.course_id")
for row in res:
    print(row)

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported

In [45]:
res=cur.execute("select * from student LEFT JOIN course on student.course_id=course.course_id")
for row in res:
    print(row)

(101, 'Amit', 25, 4, 4, 'SE', 1)
(102, 'Sumit', 28, 2, 2, 'DCO', 3)
(103, 'Kapil', 30, 2, 2, 'DCO', 3)
(104, 'Raju', 31, 1, 1, 'DS', 2)
(105, 'Amit', 25, 5, None, None, None)

In [48]:
res=cur.execute("select * from  course lEFT JOIN student on student.course_id=course.course_id")
for row in res:
    print(row)

(1, 'DS', 2, 104, 'Raju', 31, 1)
(2, 'DCO', 3, 102, 'Sumit', 28, 2)
(2, 'DCO', 3, 103, 'Kapil', 30, 2)
(3, 'Funda', 1, None, None, None, None)
(4, 'SE', 1, 101, 'Amit', 25, 4)

In [49]:
res=cur.execute("select * from  course lEFT JOIN student on student.course_id=course.course_id UNION ALL select * from  course lEFT JOIN student on student.course_id=course.course_id ")
for row in res:
    print(row)

(1, 'DS', 2, 104, 'Raju', 31, 1)
(2, 'DCO', 3, 102, 'Sumit', 28, 2)
(2, 'DCO', 3, 103, 'Kapil', 30, 2)
(3, 'Funda', 1, None, None, None, None)
(4, 'SE', 1, 101, 'Amit', 25, 4)
(1, 'DS', 2, 104, 'Raju', 31, 1)
(2, 'DCO', 3, 102, 'Sumit', 28, 2)
(2, 'DCO', 3, 103, 'Kapil', 30, 2)
(3, 'Funda', 1, None, None, None, None)
(4, 'SE', 1, 101, 'Amit', 25, 4)

# FULL OUTER JOIN  NOT SUPPORTED BUT WE CAN DO IN THE FOLLOWING WAY

In [51]:
res=cur.execute("select * from  course lEFT JOIN student USING(course_id) UNION ALL select * from  course lEFT JOIN student USING(course_id) where student.course_id IS NULL ")
for row in res:
    print(row)

(1, 'DS', 2, 104, 'Raju', 31)
(2, 'DCO', 3, 102, 'Sumit', 28)
(2, 'DCO', 3, 103, 'Kapil', 30)
(3, 'Funda', 1, None, None, None)
(4, 'SE', 1, 101, 'Amit', 25)
(3, 'Funda', 1, None, None, None)